In [1]:
import numpy as np
import pandas as pd

### Series -- Pandas series can hold any data type.

In [3]:
labels = ['A', 'B', 'C', 'D', 'E']
values = [10,20,30,40,50]
array1 = np.array(values)

In [11]:
series_1 = pd.Series(data = values, index = labels)
series_1

A    10
B    20
C    30
D    40
E    50
dtype: int64

### We can create series from dictionary.

In [17]:
dictionary_1 = {'A':1, 'B':2, 'C':3, 'D':4, 'E':5}
series_2 = pd.Series(dictionary_1)
series_2

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [18]:
series_1 + series_2 #both have integer values so addition is possible

A    11
B    22
C    33
D    44
E    55
dtype: int64

### PANDAS DATAFRAME
-- Dataframe consists of multiple pandas series

In [28]:
df = pd.DataFrame(np.random.randn(4,4),['a','b','c','d'], ['A','B','C','D'])

In [29]:
df

          A         B         C         D
a  2.747039  1.358469  1.648510  0.259498
b -1.162610 -0.632857 -0.486905 -0.542633
c -0.413674 -0.402237 -0.539031 -0.342179
d  0.446827 -2.579156 -0.126083 -1.329329

In [32]:
type(df)

pandas.core.frame.DataFrame

In [33]:
print(df['A'])
print(type(df['A']))

a    2.747039
b   -1.162610
c   -0.413674
d    0.446827
Name: A, dtype: float64
<class 'pandas.core.series.Series'>

In [35]:
df[['A','B']]

          A         B
a  2.747039  1.358469
b -1.162610 -0.632857
c -0.413674 -0.402237
d  0.446827 -2.579156

In [37]:
df['A'].mean()

0.4043954926588121

In [41]:
df['E'] = np.random.randn(4)
df

          A         B         C         D         E
a  2.747039  1.358469  1.648510  0.259498  0.107125
b -1.162610 -0.632857 -0.486905 -0.542633  0.948570
c -0.413674 -0.402237 -0.539031 -0.342179  0.339597
d  0.446827 -2.579156 -0.126083 -1.329329  1.405429

In [42]:
df.drop('E', axis=1)
df

          A         B         C         D         E
a  2.747039  1.358469  1.648510  0.259498  0.107125
b -1.162610 -0.632857 -0.486905 -0.542633  0.948570
c -0.413674 -0.402237 -0.539031 -0.342179  0.339597
d  0.446827 -2.579156 -0.126083 -1.329329  1.405429

In [43]:
df.drop('E', axis=1,inplace=True)
df

          A         B         C         D
a  2.747039  1.358469  1.648510  0.259498
b -1.162610 -0.632857 -0.486905 -0.542633
c -0.413674 -0.402237 -0.539031 -0.342179
d  0.446827 -2.579156 -0.126083 -1.329329

### loc and iloc

In [46]:
df.loc['a']

A    2.747039
B    1.358469
C    1.648510
D    0.259498
Name: a, dtype: float64

In [47]:
df.iloc[0]

A    2.747039
B    1.358469
C    1.648510
D    0.259498
Name: a, dtype: float64

In [48]:
df.loc['a','A']

2.7470391799970697

In [53]:
df

          A         B         C         D
a  2.747039  1.358469  1.648510  0.259498
b -1.162610 -0.632857 -0.486905 -0.542633
c -0.413674 -0.402237 -0.539031 -0.342179
d  0.446827 -2.579156 -0.126083 -1.329329

In [55]:
df.loc[['a','b'], ['A','B','C']]

          A         B         C
a  2.747039  1.358469  1.648510
b -1.162610 -0.632857 -0.486905

In [56]:
df>0

       A      B      C      D
a   True   True   True   True
b  False  False  False  False
c  False  False  False  False
d   True  False  False  False

In [57]:
df[df>0]

          A         B        C         D
a  2.747039  1.358469  1.64851  0.259498
b       NaN       NaN      NaN       NaN
c       NaN       NaN      NaN       NaN
d  0.446827       NaN      NaN       NaN

### RESETTING THE INDEX

In [61]:
data =[[1,2,3],[4,5,6,],[7,8,9]]
df = pd.DataFrame(data, index=['a','b','c'], columns=['N1', 'N2','N3'])

In [62]:
df.reset_index()

  index  N1  N2  N3
0     a   1   2   3
1     b   4   5   6
2     c   7   8   9

In [63]:
df

   N1  N2  N3
a   1   2   3
b   4   5   6
c   7   8   9

In [64]:
df.reset_index(inplace=True)

In [65]:
df

  index  N1  N2  N3
0     a   1   2   3
1     b   4   5   6
2     c   7   8   9

### SETTING NEW INDEX

In [67]:
df['new_index'] = ['I1', 'I2', 'I3']

In [68]:
df

  index  N1  N2  N3 new_index
0     a   1   2   3        I1
1     b   4   5   6        I2
2     c   7   8   9        I3

In [69]:
df.set_index('new_index', inplace=True)
df

          index  N1  N2  N3
new_index
I1            a   1   2   3
I2            b   4   5   6
I3            c   7   8   9

In [1]:
import numpy as np
import pandas as pd

## Dropping NaN datas in Pandas

In [6]:
di = {'X':[1,2,np.NAN], 'Y':[3,4,5], 'Z':[np.nan,6, np.nan]}
df = pd.DataFrame(di)
df

     X  Y    Z
0  1.0  3  NaN
1  2.0  4  6.0
2  NaN  5  NaN

In [7]:
df.dropna() # drop rows even if it has 1 NaN

     X  Y    Z
1  2.0  4  6.0

In [8]:
df.dropna(axis=1) # default axis =0

   Y
0  3
1  4
2  5

In [9]:
df.dropna(thresh=2) # setting threshold to drop

     X  Y    Z
0  1.0  3  NaN
1  2.0  4  6.0

In [10]:
df

     X  Y    Z
0  1.0  3  NaN
1  2.0  4  6.0
2  NaN  5  NaN

In [12]:
df.fillna(value='Fill')

      X  Y     Z
0     1  3  Fill
1     2  4     6
2  Fill  5  Fill

## GROUPBY

In [18]:
import pandas as pd
d = {'Company':['1','2','2','1','2','1'],
       'Person':['A','B','C','D','E','F'],
       'Points':[100,210,342,133,423,354]}

df = pd.DataFrame(d)
df

  Company Person  Points
0       1      A     100
1       2      B     210
2       2      C     342
3       1      D     133
4       2      E     423
5       1      F     354

In [19]:
groupby_company = df.groupby('Company')

In [20]:
groupby_company

In [21]:
groupby_company.mean()

             Points
Company
1        195.666667
2        325.000000

In [22]:
df.groupby('Company').count()

         Person  Points
Company
1             3       3
2             3       3

In [23]:
df.groupby('Company').max()

        Person  Points
Company
1            F     354
2            E     423

In [25]:
df.groupby('Company').describe()

        Points
         count        mean        std    min    25%    50%    75%    max
Company
1          3.0  195.666667  138.10986  100.0  116.5  133.0  243.5  354.0
2          3.0  325.000000  107.51279  210.0  276.0  342.0  382.5  423.0

In [26]:
text = 'https://www.premierleague.com/tables'
data = pd.read_html(text)

In [27]:
data[0].head()

,Position Pos,Club,Played Pl,Won W,Drawn D,Lost L,GF,GA,GD,Points Pts,Form,Next,Unnamed: 12
0,1 Previous Position 1,Liverpool LIV,15,9,5,1,37,20,+17,32,W Sunday 6 December 2020 LIV 4 -0 WOL D ...,Newcastle United Wednesday 30 December 2021 ...,NaN
1,Liverpool Recent Result - Sunday 27 December ...,Liverpool Recent Result - Sunday 27 December ...,Liverpool Recent Result - Sunday 27 December ...,Liverpool Recent Result - Sunday 27 December ...,Liverpool Recent Result - Sunday 27 December ...,Liverpool Recent Result - Sunday 27 December ...,Liverpool Recent Result - Sunday 27 December ...,Liverpool Recent Result - Sunday 27 December ...,Liverpool Recent Result - Sunday 27 December ...,Liverpool Recent Result - Sunday 27 December ...,Liverpool Recent Result - Sunday 27 December ...,Liverpool Recent Result - Sunday 27 December ...,Liverpool Recent Result - Sunday 27 December ...
2,2 Previous Position 4,Everton EVE,15,9,2,4,26,19,+7,29,D Saturday 5 December 2020 BUR 1 -1 EVE W...,Manchester City Monday 28 December 2021 EVE ...,NaN
3,Everton Recent Result - Saturday 26 December ...,Everton Recent Result - Saturday 26 December ...,Everton Recent Result - Saturday 26 December ...,Everton Recent Result - Saturday 26 December ...,Everton Recent Result - Saturday 26 December ...,Everton Recent Result - Saturday 26 December ...,Everton Recent Result - Saturday 26 December ...,Everton Recent Result - Saturday 26 December ...,Everton Recent Result - Saturday 26 December ...,Everton Recent Result - Saturday 26 December ...,Everton Recent Result - Saturday 26 December ...,Everton Recent Result - Saturday 26 December ...,Everton Recent Result - Saturday 26 December ...
4,3 Previous Position 2,Leicester City LEI,15,9,1,5,28,19,+9,28,W Sunday 6 December 2020 SHU 1 -2 LEI W ...,Crystal Palace Monday 28 December 2021 CRY ...,NaN